<?php

use Illuminate\Database\Seeder;
use App\Models\ateModel;

class nokoAteSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $noko_ate = array(
            array(
                1263,
                "Акшинский район",
            ),
            array(
                1264,
                "Балейский район",
            ),
            array(
                1265,
                "Борзинский район",
            ),
            array(
                1266,
                "Агинский район",
            ),
            array(
                1267,
                "Петровск-Забайкальский район",
            ),
            array(
                1268,
                "Нерчинско-Заводский район",
            ),
            array(
                1269,
                "Александрово-Заводский район",
            ),
            array(
                1270,
                "Хилокский район",
            ),
            array(
                1271,
                "Краснокаменский район",
            ),
            array(
                1272,
                "Забайкальский район",
            ),
            array(
                1273,
                "Каларский район",
            ),
            array(
                1274,
                "Приаргунский район",
            ),
            array(
                1275,
                "Дульдургинский район",
            ),
            array(
                1276,
                "Горный (городской округ ЗАТО пос.)",
            ),
            array(
                1277,
                "Шилкинский район",
            ),
            array(
                1278,
                "Карымский район",
            ),
            array(
                1279,
                "Агинское (пгт)",
            ),
            array(
                1280,
                "Министерство образования ЗК",
            ),
            array(
                1281,
                "Сретенский район",
            ),
            array(
                1282,
                "Читинский район",
            ),
            array(
                1283,
                "Улётовский район",
            ),
            array(
                1284,
                "Чита (город)",
            ),
            array(
                1285,
                "Тунгокоченский район",
            ),
            array(
                1286,
                "Петровск-Забайкальский (город)",
            ),
            array(
                1287,
                "Ононский район",
            ),
            array(
                1288,
                "Калганский район",
            ),
            array(
                1289,
                "Могойтуйский район",
            ),
            array(
                1290,
                "Шелопугинский район",
            ),
            array(
                1291,
                "Нерчинский район",
            ),
            array(
                1292,
                "Газимуро-Заводский район",
            ),
            array(
                1293,
                "Кыринский район",
            ),
            array(
                1294,
                "Могочинский район",
            ),
            array(
                1295,
                "Оловяннинский район",
            ),
            array(
                1296,
                "Тунгиро-Олекминский район",
            ),
            array(
                1297,
                "Чернышевский район",
            ),
            array(
                1299,
                "Красночикойский район",
            ),
            array(
                1300,
                "Внешние организации",
            ),
            array(
                1301,
                "Забайкальский край",
            ),
        );
        foreach($noko_ate as $noko){
            $buffer = ['id' => $noko[0], 'name' => $noko[1]];
            ateModel::create($buffer);
        }

    }
}
